print('aa' + 'bb')
print([1, 2, 3] + [4, 5, 6] + ['a', 'b'])
print((1, 2, 3) + ('a', 'b'))
# print({1, 2, 3} + {'a', 'b'})             # +不支持集合, 因为集合元素具有 唯一性. 合并可能存在重复元素, 然后会自动删除重复的, 无意义.
# print({'name': '张三', 'age': 23} + {'name': '李四', 'address':'北京'})     # +不支持字典, 键具有唯一性.

# 演示 *           表示: 复制, 可以作用于: 字符串, 列表, 元组
print('-' * 28)
print([1, 2, 3] * 2)
print((1, 2, 3) * 2)
# print({1, 2, 3} * 2)    # *不能作用于集合, 集合元素具有唯一性.
# print({'name': '张三', 'age': 23} * 2)    # *不能作用于字典, 键具有唯一性
print('-' * 28)

# 演示 in          表示: 是否在, 可以作用于: 字符串, 列表, 元组, 字典
print('a' in 'abc')
print(10 in [10, 20, 30])
print(10 in (10, 20, 30))
print(10 in {10, 20, 30})
print('name' in {'name': '张三', 'age': 23})  # 字典只能判断是否包含这个键.
print(23 in {'name': '张三', 'age': 23})      # 字典只能判断是否包含这个键.
print('-' * 28)

# 演示 not in      表示: 是否不在, 可以作用于: 字符串, 列表, 元组, 字典
print('a' not in 'abc')
print(10 not in [10, 20, 30])
print(10 not in (10, 20, 30))
print(10 not in {10, 20, 30})
print('name' not in {'name': '张三', 'age': 23})  # 字典只能判断是否包含这个键.
print(23 not in {'name': '张三', 'age': 23})      # 字典只能判断是否包含这个键.
